================================================================================
Function definition
================================================================================

fn pi() = 3.14

--------------------------------------------------------------------------------

(source_file
  (function_decl
    (identifier)
    (number)))

================================================================================
Function definition without body
================================================================================

fn pi()

--------------------------------------------------------------------------------

(source_file
  (function_decl
    (identifier)))

================================================================================
Function definition with parameters
================================================================================

fn pi(n) = n * 3.14
fn multipi(a, b, c) = a * 3.14 * b * c

--------------------------------------------------------------------------------

(source_file
  (function_decl
    (identifier)
    (identifier)
    (factor
      (identifier)
      (multiply)
      (number)))
  (function_decl
    (identifier)
    (identifier)
    (identifier)
    (identifier)
    (factor
      (factor
        (factor
          (identifier)
          (multiply)
          (number))
        (multiply)
        (identifier))
      (multiply)
      (identifier))))

================================================================================
Function definition with types
================================================================================

fn pi() -> Scalar = 3.14
fn pi2(n: Scalar) -> Scalar = n * 3.14

--------------------------------------------------------------------------------

(source_file
  (function_decl
    (identifier)
    (type_annotation
      (dimension_expr
        (identifier)))
    (number))
  (function_decl
    (identifier)
    (identifier)
    (dimension_expr
      (identifier))
    (type_annotation
      (dimension_expr
        (identifier)))
    (factor
      (identifier)
      (multiply)
      (number))))

================================================================================
Bug #2
================================================================================

fn from_fahrenheit(t_fahrenheit: Scalar) -> Temperature
fn to_fahrenheit(t_kelvin: Temperature) -> Scalar = (t_kelvin / kelvin) / scale_fahrenheit - offset_fahrenheit

--------------------------------------------------------------------------------

(source_file
  (function_decl
    (identifier)
    (identifier)
    (dimension_expr
      (identifier))
    (type_annotation
      (dimension_expr
        (identifier))))
  (function_decl
    (identifier)
    (identifier)
    (dimension_expr
      (identifier))
    (type_annotation
      (dimension_expr
        (identifier)))
    (factor
      (factor
        (identifier)
        (divide)
        (identifier))
      (divide)
      (term
        (identifier)
        (minus)
        (identifier)))))

================================================================================
Function definition multiline
================================================================================
fn foo(
  a: Voltage,
  b: Voltage) -> Voltage = a

--------------------------------------------------------------------------------
(source_file
 (function_decl
  (identifier)
  (identifier)
  (dimension_expr
   (identifier))
  (identifier)
  (dimension_expr
   (identifier))
  (type_annotation
   (dimension_expr
    (identifier)))
  (identifier)))
================================================================================
Function definition with struct in body
================================================================================

fn calc_fb_resistors(
  a: Voltage, b: Voltage,
  c: Voltage,
  d: Voltage) -> ThreeWayDivider =
  ThreeWayDivider {
    r_a: fb_r_a,
    r_b: r_b,
    r_c: r_c
  }
  where alpha = (opamp_v_max - opamp_v_min) / (v_out_max - v_out_min)
    and r_c = fb_r_a * alpha
    and r_b = fb_vref / (((v_out_max - fb_vref) / fb_r_a) + ((opamp_v_min - fb_vref) / r_c))

--------------------------------------------------------------------------------
(source_file
 (function_decl
  (identifier)
  (identifier)
  (dimension_expr
   (identifier))
  (identifier)
  (dimension_expr
   (identifier))
  (identifier)
  (dimension_expr
   (identifier))
  (identifier)
  (dimension_expr
   (identifier))
  (type_annotation
   (dimension_expr
    (identifier)))
  (struct_expression
   (identifier)
   (identifier)
   (identifier)
   (identifier)
   (identifier)
   (identifier)
   (identifier))
(identifier)
        (factor
         (term
          (identifier)
          (minus)
          (identifier))
         (divide)
         (term
          (identifier)
          (minus)
          (identifier)))
(identifier)
        (factor
         (identifier)
         (multiply)
         (identifier))
(identifier)
        (factor
         (identifier)
         (divide)
         (term
          (factor
           (term
            (identifier)
            (minus)
            (identifier))
           (divide)
           (identifier))
          (plus)
          (factor
           (term
            (identifier)
            (minus)
            (identifier))
           (divide)
           (identifier))))))
